; лямбда-вызов нахождения площади окружности с R = 3
((lambda (R) (* 3.14 R R)) 3)

; функция нахождения площади окружности с радиусом R
(defun S (R) (* 3.14 R R))

; функция проверки принадленжности точки с координатами (X, Y)
; правильному 6-угольнику со стороной A с центром в точке (0, 0)
(defun in_polygon (X Y A) 
    (if (and
        (<= Y (* (/ A 2) (sqrt 3)))
        (<= Y (- (* A (sqrt 3)) (* X (sqrt 3))))
        (<= Y (+ (* A (sqrt 3)) (* X (sqrt 3))))
        (>= Y (- (* (/ A 2) (sqrt 3))))
        (>= Y (- (- (* A (sqrt 3))) (* X (sqrt 3))))
        (>= Y (+ (- (* A (sqrt 3))) (* X (sqrt 3))))
    ) T NIL)
)